## Plan Result (stg_backendappgateway)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Delete
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;juror-bureau&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw"
        name                              = "aks00-stg-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/juror-bureau" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "juror-bureau" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/darts-api" -> null
          - name                                = "darts-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/darts-api" -> null
          - probe_name                          = "darts-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/darts-gateway" -> null
          - name                                = "darts-gateway" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/darts-gateway" -> null
          - probe_name                          = "darts-gateway" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/darts-stub-services" -> null
          - name                                = "darts-stub-services" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/darts-stub-services" -> null
          - probe_name                          = "darts-stub-services" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/juror-bureau" -> null
          - name                                = "juror-bureau" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/juror-bureau" -> null
          - probe_name                          = "juror-bureau" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/juror-pnc" -> null
          - name                                = "juror-pnc" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/juror-pnc" -> null
          - probe_name                          = "juror-pnc" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/juror-scheduler-api" -> null
          - name                                = "juror-scheduler-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/juror-scheduler-api" -> null
          - probe_name                          = "juror-scheduler-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/juror-scheduler-execution" -> null
          - name                                = "juror-scheduler-execution" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/juror-scheduler-execution" -> null
          - probe_name                          = "juror-scheduler-execution" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/lgy-iac-web" -> null
          - name                                = "lgy-iac-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/lgy-iac-web" -> null
          - probe_name                          = "lgy-iac-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/opal-fines-service" -> null
          - name                                = "opal-fines-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/opal-fines-service" -> null
          - probe_name                          = "opal-fines-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pip-account-management" -> null
          - name                                = "pip-account-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/pip-account-management" -> null
          - probe_name                          = "pip-account-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pip-business-rules" -> null
          - name                                = "pip-business-rules" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/pip-business-rules" -> null
          - probe_name                          = "pip-business-rules" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pip-channel-management" -> null
          - name                                = "pip-channel-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/pip-channel-management" -> null
          - probe_name                          = "pip-channel-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pip-data-management" -> null
          - name                                = "pip-data-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/pip-data-management" -> null
          - probe_name                          = "pip-data-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pip-publication-services" -> null
          - name                                = "pip-publication-services" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/pip-publication-services" -> null
          - probe_name                          = "pip-publication-services" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pip-subscription-management" -> null
          - name                                = "pip-subscription-management" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/pip-subscription-management" -> null
          - probe_name                          = "pip-subscription-management" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pre-api" -> null
          - name                                = "pre-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/pre-api" -> null
          - probe_name                          = "pre-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pre-portal" -> null
          - name                                = "pre-portal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/probes/pre-portal" -> null
          - probe_name                          = "pre-portal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/toffee-recipe-backend" -> null
          - name                                = "toffee-recipe-backend" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

       + backend_http_settings_name = "pip-channel-management"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/pip-channel-management"
          + http_listener_name         = "pip-channel-management"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/pip-channel-management"
          + name                       = "pip-channel-management"
          + priority                   = 100
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pip-data-management"
          + backend_address_pool_name  = "pip-data-management"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pip-data-management"
          + backend_http_settings_name = "pip-data-management"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/pip-data-management"
          + http_listener_name         = "pip-data-management"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/pip-data-management"
          + name                       = "pip-data-management"
          + priority                   = 90
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pip-publication-services"
          + backend_address_pool_name  = "pip-publication-services"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pip-publication-services"
          + backend_http_settings_name = "pip-publication-services"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/pip-publication-services"
          + http_listener_name         = "pip-publication-services"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/pip-publication-services"
          + name                       = "pip-publication-services"
          + priority                   = 80
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pip-subscription-management"
          + backend_address_pool_name  = "pip-subscription-management"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pip-subscription-management"
          + backend_http_settings_name = "pip-subscription-management"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/pip-subscription-management"
          + http_listener_name         = "pip-subscription-management"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/pip-subscription-management"
          + name                       = "pip-subscription-management"
          + priority                   = 110
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pre-api"
          + backend_address_pool_name  = "pre-api"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pre-api"
          + backend_http_settings_name = "pre-api"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/pre-api"
          + http_listener_name         = "pre-api"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/pre-api"
          + name                       = "pre-api"
          + priority                   = 180
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/pre-portal"
          + backend_address_pool_name  = "pre-portal"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/pre-portal"
          + backend_http_settings_name = "pre-portal"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/pre-portal"
          + http_listener_name         = "pre-portal"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/pre-portal"
          + name                       = "pre-portal"
          + priority                   = 170
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/toffee-recipe-backend"
          + backend_address_pool_name  = "toffee-recipe-backend"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/toffee-recipe-backend"
          + backend_http_settings_name = "toffee-recipe-backend"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/toffee-recipe-backend"
          + http_listener_name         = "toffee-recipe-backend"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/toffee-recipe-backend"
          + name                       = "toffee-recipe-backend"
          + priority                   = 10
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/vh-bookings-api"
          + backend_address_pool_name  = "vh-bookings-api"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/vh-bookings-api"
          + backend_http_settings_name = "vh-bookings-api"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/vh-bookings-api"
          + http_listener_name         = "vh-bookings-api"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/vh-bookings-api"
          + name                       = "vh-bookings-api"
          + priority                   = 60
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/vh-notification-api"
          + backend_address_pool_name  = "vh-notification-api"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/vh-notification-api"
          + backend_http_settings_name = "vh-notification-api"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/vh-notification-api"
          + http_listener_name         = "vh-notification-api"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/vh-notification-api"
          + name                       = "vh-notification-api"
          + priority                   = 50
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/vh-test-api"
          + backend_address_pool_name  = "vh-test-api"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/vh-test-api"
          + backend_http_settings_name = "vh-test-api"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/vh-test-api"
          + http_listener_name         = "vh-test-api"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/vh-test-api"
          + name                       = "vh-test-api"
          + priority                   = 40
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/vh-user-api"
          + backend_address_pool_name  = "vh-user-api"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/vh-user-api"
          + backend_http_settings_name = "vh-user-api"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/vh-user-api"
          + http_listener_name         = "vh-user-api"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/vh-user-api"
          + name                       = "vh-user-api"
          + priority                   = 20
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendAddressPools/vh-video-api"
          + backend_address_pool_name  = "vh-video-api"
          + backend_http_settings_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/backendHttpSettingsCollection/vh-video-api"
          + backend_http_settings_name = "vh-video-api"
          + http_listener_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/httpListeners/vh-video-api"
          + http_listener_name         = "vh-video-api"
          + id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw/requestRoutingRules/vh-video-api"
          + name                       = "vh-video-api"
          + priority                   = 30
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "juror-pnc"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "juror-pnc"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "juror-pnc"
          + id                         = (known after apply)
          + name                       = "juror-pnc"
          + priority                   = 210
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "juror-scheduler-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "juror-scheduler-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "juror-scheduler-api"
          + id                         = (known after apply)
          + name                       = "juror-scheduler-api"
          + priority                   = 190
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "juror-scheduler-execution"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "juror-scheduler-execution"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "juror-scheduler-execution"
          + id                         = (known after apply)
          + name                       = "juror-scheduler-execution"
          + priority                   = 200
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "opal-fines-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "opal-fines-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "opal-fines-service"
          + id                         = (known after apply)
          + name                       = "opal-fines-service"
          + priority                   = 220
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      ~ ssl_policy {
          + min_protocol_version = "TLSv1_2"
            # (4 unchanged attributes hidden)
        }

        # (31 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks00-stg-agw|app-gw-storage-account"
        name                           = "app-gw-storage-account"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["juror-bureau"] will be destroyed
  # (because key ["juror-bureau"] is not in for_each map)
  - resource "azurerm_private_dns_a_record" "this" {
      - fqdn                = "juror-bureau.staging.platform.hmcts.net." -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/staging.platform.hmcts.net/A/juror-bureau" -> null
      - name                = "juror-bureau" -> null
      - records             = [
          - "10.148.32.138",
        ] -> null
      - resource_group_name = "core-infra-intsvc-rg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "staging.platform.hmcts.net" -> null
    }

Plan: 0 to add, 2 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":667,"Program":"tfcmt","SHA1":"","Target":"stg_backendappgateway","Vars":{}} -->